import asyncio  # Імпортуємо модуль для роботи з асинхронністю
from aiogram import Bot, Dispatcher, F  # Імпортуємо необхідні компоненти з бібліотеки aiogram
from aiogram.types import Message, FSInputFile
from aiogram.filters import CommandStart, Command
import app
from aiogram.enums import ParseMode
from aiogram.fsm.state import State, StatesGroup
from aiogram.fsm.storage.memory import MemoryStorage
from aiogram.fsm.context import FSMContext

from app import key
from config import TOKEN

bot = Bot(token=TOKEN)  # Ініціалізуємо об'єкт бота з токеном
dp = Dispatcher()  # Ініціалізуємо диспетчер для обробки подій (команд, повідомлень тощо)


@dp.message(CommandStart())
async def cmd_start(message: Message):
    await message.answer('Вас вітає Руттенштайнер бот! Будь ласка виберіть категорію', reply_markup=app.key)


@dp.message(F.text == 'Наші послуги')
async def cmd_text1(message: Message):
    await message.answer("""<b>📌 Загальні та додаткові послуги</b>

🏢 Створення та реєстрація приватного підприємця в Австрії
€ 1000
Ми беремо на себе виконання всіх необхідних заходів

🏠 Щомісячні поточні витрати на адресу офісу
Від € 600
Необхідно, лише якщо у вас немає власної адреси

📊 Реєстрація облікових і податкових номерів в органах
€ 500

👔 Реєстрація стандартного трудового договору
€ 300

📒 Ведення бухгалтерії
€ 140 / година

👤 Консультації – для фізичних осіб
€ 170 / година

🧠 Консультування бізнесу підприємства
€ 190 / година

⚖️ Юридичні консультації
€ 320 / година

🔧 Послуги робочого персоналу для поточного бізнесу
€ 90 / година

🔄 Зміна керівника
€ 950

🏢 Переміщення компанії, зареєстрованої в Австрії
€ 950

☎️ Номер стаціонарного телефону
€ 55 / місяць
+ € 150 одноразово за налаштування

🚚 Міні-вантажівка для бізнесу
€ 600 / місяць

🎤 Супровід виставок у межах ЄС
€ 900 / день

👨‍💼 B2B Спеціалісти з продажів з досвідом до 5 років
€ 6900 / місяць

👨‍💼 B2B Спеціалісти з продажів з досвідом 5–10 років
€ 9900 / місяць

👨‍💼 B2B Спеціалісти з продажів з досвідом понад 10 років
€ 13000 / місяць

❓ Не знайшли потрібну послугу?
Просто повідомте нам, що саме вам потрібно — ми підготуємо індивідуальну пропозицію.

📜 Умови надання консультацій
(включає підрозділи: Разова сума, Термін надання послуг, Контроль, Розширення та зміна проекту, Дострокове припинення, Витрати в разі розірвання договору, Незалежність, Конфіденційність, Платежі, Інше)""", parse_mode=ParseMode.HTML)


@dp.message(F.text == '')
async def cmd_text1(message: Message):
    await message.answer('')


@dp.message(F.text == 'Ваша філія в ЄС')
async def cmd_text1(message: Message):
    await message.answer("""📂 С Т В О Р Е Н Н Я Ф І Л І Ї Д Л Я В А Ш О Г О Б І З Н Е С У В Є С
✅ Задача
Ми можемо надати вам підтримку у створенні філії в Австрії та офіційно представляти її в органах влади, поки ви не призначите постійного представника або не переїдете на нову адресу.

🧾 Консультації щодо створення та реєстрації філії
Створення зареєстрованої філії в Австрії (разова сума) – €6000
Включає всі держсбори, нотаріальні й судові витрати. Переклади оплачуються окремо.

Доплата за додаткові послуги (разова сума) – €2600
Необхідна при особливих політичних/правових умовах (санкції, AML тощо).

Реєстрація VAT в податкових органах (Finanzamt) – €500

Допомога з відкриттям банківського рахунку (погодинно) – €190

компенсація витрат

Допомога з поданням заяви на ліцензування (погодинно) – €140

🧩 Додаткові послуги з керування філією
Доступні лише після створення філії нами.

Постійний представник (за місяць) – від €1600
Оплата за 2 місяці наперед. Представництво діє до заміни або закриття філії.

Адреса офісу (щомісячно) – €600
Мінімальний термін: 6 місяців.

Налаштування зарплатної системи (одноразово) – €400

Обслуговування зарплати працівника (щомісяця) – €60 / особа

Back Office (обробка інвойсів) – €120 / місяць

Бухгалтерський облік (погодинно) – €140

Бізнес-консультування (погодинно) – €190

Юридичні консультації (погодинно) – €320

🛂 Імміграційна підтримка
Дозвіл на проживання/роботу для членів правління – €1700 / особа
(для країн не з ЄС, без держмита та витрат на переклад)

Заява про працевлаштування для працівника з-за меж ЄС – €1000 / особа

🧰 Робочий персонал (за потреби)
Послуги персоналу (погодинно) – €90
Склад, перевезення, меблі тощо. За потреби інструментів — рахунок окремо.

📋 Що потрібно для створення філії
Назва та адреса материнської компанії

🔹Статутні документи

🔹Дані акціонерів

🔹Дані офіційного представника в Австрії

🔹Фінансовий рік

🔹Опис діяльності

🔹Прогноз доходів і прибутку на 1-й та 2-й рік

❗ ВАЖЛИВО: Усі документи мають бути перекладені присяжним перекладачем (з апостилем). У разі залучення австрійської компанії — додається 20% ПДВ.

❓ Не знайшли потрібну послугу?
Жодної проблеми — зверніться до нас, і ми підготуємо індивідуальну пропозицію, адаптовану під ваші потреби.

📜 Умови надання консультацій
💶 Разова сума
Покриває: робочий час, офіс, дослідження, підготовку. Не включає: держмита, переклади, витрати на перекладача.

⏳ Термін надання послуг
Початок – дата в договорі або дата отримання передоплати. Завершення – після досягнення цілі або вказаної дати.

📈 Контроль
Виконавець регулярно інформує про стан справ. Клієнт отримує оновлення законодавства.

🔁 Розширення / зміна
Додаткові зміни погоджуються окремо.

❌ Дострокове припинення
Можливе після 6 міс. співпраці з 2-місячним попередженням. Клієнт покриває витрати на зміну адреси / представника.

💸 Витрати при розірванні
Компенсація не повертається.

🧑‍💼 Незалежність
Виконавець працює автономно, якщо не узгоджено інше.

🔐 Конфіденційність
Уся інформація – конфіденційна. Не передається третім особам без згоди.

💳 Платежі
Рахунки оплачуються негайно. Після 30 днів – передаються до KSV1870.

Для клієнтів з-за меж ЄС:
IBAN: AT38 3411 4000 0010 5908 | BIC: RZOOAT2L114

Для клієнтів у межах ЄС:
IBAN: AT89 1860 0000 1650 9309 | BIC: VKBLAT2L

📝 Інше
Пункти цього документа доповнюють умови на:
www.ruttensteiner.com/images/AGB/AGB-2016-DE.pdf
Оскарження та скорочення строків згідно §871 і §934 ABGB — не допускаються.""")


@dp.message(F.text == 'Ваша компанія в ЄС')
async def cmd_text1(message: Message):
    await message.answer("""🌍 С Т В О Р Е Н Н Я ТОВ/LTD/GmbH Д Л Я В А Ш О Г О Б І З Н Е С У в Е С

Ми можемо надати вам підтримку у створенні вашої філії в Австрії та взяти на себе офіційне представництво філії в органах влади та державних установах доти, доки ви не наймете керуючого директора/постійного представника в Австрії і не переїдете на іншу адресу. 🏢

📜 Консультації щодо створення та реєстрації ТОВ/LTD/GmbH:

Створення та реєстрація Ltd (GmbH) в Австрії (разова сума):
€ 6500

Фіксована ставка покриває всі витрати, пов’язані зі створенням та реєстрацією ТОВ у Комерційному реєстрі. Включно з усіма державними, нотаріальними та судовими зборами. За винятком того, що витрати на переклад стягуються додатково! Ми беремо на себе всі необхідні дії, нотаріальні зустрічі, судові зустрічі, переговори з торгово-промисловою палатою і так далі. Для цього не обов’язково приїжджати до Австрії. Коли ви реєструєте банківський рахунок компанії для нового GmbH, вам, можливо, доведеться приїхати до Австрії, щоб підписати. Необхідність цього залежить від контракту GmbH, історії вашої компанії та наявного банківського рахунку. Створення стандартної угоди про партнерство включено в фіксовану ставку. Комісія буде виставлена під час розміщення замовлення. Якщо реєстрація компанії оплачується австрійською компанією, ми повинні будемо стягнути додатково 20% ПДВ. Якщо гонорар сплачує іноземна компанія, австрійський ПДВ не сплачується.

Доплата за додаткові послуги (разова сума):
€ 2600
Через політичну ситуацію в деяких країнах потрібні додаткові докази та контакти з владою. Ця необхідність обумовлена нормами Закону про відмивання грошей, Закону про фінансування тероризму, а також необхідність дотримання існуючих санкцій. Вирішальним фактором тут виступає наявність паспорту та реєстрації за останні 5 років.

Реєстрація Вас як платника VAT TAX в налогових органах Австрії (Finanzamt):
€ 500

💳 Допомога з відкриттям банківського рахунку (погодинно) + компенсація грошових витрат і транспортних витрат:
€ 190

📝 Допомога з поданням заяви на ліцензування (погодинно):
€ 140

📜 Супровід в складанні індивідуальної угоди (погодинно) плюс готівкові витрати та витрати на проїзд:
€ 190

📑 Договір про створення Компанії, Установчий договір, Статут товариства:
€ 500

🔐 Реєстрація бенефіціарів Компанія і внесення змін за потребою (погодинно):
€ 170

👨‍💼 Керуючий Директор

Для австрійського GmbH Вам потрібен принаймні один керуючий директор, який проживає поблизу GmbH. Найняти його можна двома способами.

Варіант 1:
Керуючий директор працює в GmbH принаймні 20 годин на тиждень відповідно до чинного закону про GmbH. Винагорода має відповідати встановленій законом схемі заробітної плати, яка включає всі податки та збори, щонайменше 4000 євро на місяць за 20 годин на тиждень.

Варіант 2:
Керуючий директор володіє не менше 25% статутного капіталу. (З початковим внеском у 5000 євро керуючий директор мав би заплатити 1250 євро). Це означає, що він вважається бізнесменом і більше не повинен отримувати зарплату відповідно до закону про найманих працівників. Винагороду можна вільно визначати в договорі. Керуючий директор несе відповідальність за ліцензію на підприємницьку діяльність і належне ведення господарської діяльності.

Необхідний капітальний внесок для GmbH в Австрії становить 10 000 євро. Принаймні половина цієї суми (5000 євро) має бути внесена на рахунок компанії нового GmbH під час заснування. Початковий статутний капітал повинен бути сплачений безпосередньо на рахунок компанії нового GmbH. Початковий статутний капітал у розмірі щонайменше 5000 євро не входить до зазначених вище зборів! 💰

Додаткові послуги у керуванні філією
Ці послуги можуть бути надані тільки у випадку, якщо ми вже зареєстрували Компанію.

🏢 Місячна плата за офісну адресу (від 600 € за місяць залежно від локації):
від 600 €
Необхідно, лише якщо у вас немає власної адреси. Фіксована ставка покриває всі витрати на офіційну адресу GmbH в Австрії. Оплата мінімум за 6 місяців.

🧾 Налаштування розрахунку заробітної плати та нарахування заробітної плати в нашій системі (одноразово):
€ 400
Ця послуга необхідна, лише якщо ви наймете нас для ведення бухгалтерського обліку та нарахування заробітної плати за вас.

💼 Обслуговування місячної з/п на одного працівника Компанії (разово, на місяць і на працівника):
€ 60

🏢 Послуги робочого персоналу для Вашого бізнесу (разово, за годину):
€ 90
Наприклад, для складу: приймання поставок, розпакування, перепакування, сортування та пакування товарів, підготовка до подальшого відправлення.

💼 Послуги Back Office (обслуговування інвойсів):
€ 120

📊 Ведення бухгалтерії Компанії (погодинна сплата):
€ 140

💼 Консультування бізнесу Компанії (погодинна сплата):
€ 190

⚖️ Юридичні консультації (погодинна сплата):
€ 320

🛂 Заява та оформлення дозволів на проживання/роботу для членів правління:
€ 1900
Для людей з країн, що не входять до ЄС. (разова сума з особи, без урахування державного мита та всіх інших зборів, витрат на переклад довідок).

👨‍💼 Найм Керуючого Директора (за місяць):
€ 4000
В якості Керуючого Директора виступить Магістр бізнес адміністрування Дітмар Ервін Руттенштейнер.

Ви не знайшли послугу, яку шукали?
Це не є проблемою. Просто повідомте нам, яка послуга вам потрібна, і ми подбаємо про це і зробимо вам пропозицію, адаптовану до ваших потреб. 💬

📑 Умови надання консультацій

Разова сума:
Наші фіксовані ставки покривають такі витрати Ruttensteiner Consulting: працівники, робочий час, офісні витрати, додаткові витрати, витрати на дослідження та підготовку, витрати на асистентів. Якщо не зазначено інше. Сюди не входять: державні збори, нотаріальні та судові збори.

⏳ Термін надання послуг:
Послуга починається якнайшвидше з замовлення послуги.

🔄 Контроль:
Виконавець зобов'язаний регулярно інформувати клієнта про хід роботи Компанії.

💼 Розширення та зміна проекту:
Розширення проекту мають бути сформульовані та погоджені.

❌ Дострокове припинення:
Співпраця може бути припинена в будь-який час, починаючи з шостого місяця, за умови попередження за 2 місяці з обох сторін.

💸 Витрати в разі розірвання договору:
Повне або часткове повернення вже виставлених рахунків виключається у випадку розірвання контракту.

🔐 Конфіденційність:
Вся інформація, яка доводиться до відома виконавця в ході його консультаційної роботи, є конфіденційною.

💳 Платіжи:
Рахунки завжди мають бути негайно сплачени після отримання.

Інше:
Перелічені тут пункти договору зам""")


@dp.message(F.text == 'Ваш товар в ЄС')
async def cmd_text1(message: Message):
    await message.answer("""НАШІ ПОСЛУГИ ПО ДИСТРИБУЦІЇ ВАШОГО
ТОВАРУ в ЕВРОПЕЙСЬКОМУ СОЮЗІ🌍📦

Ми можемо надати вам підтримку у дистрибуції вашого товару в ЕС тільки за умов, якщо Ви вже є нашим клієнтом і відкрили у нас Компанію, яку ми ведемо. 🏢

💶 Щомісячна фіксована ставка (термін 12 місяців)
€ 3000

📈 • Надання каналу дистрибуції через відділ продажів Ruttensteiner GmbH для дистрибуції в Європі до бажаної клієнтської бази.
🔄 • Ми беремо на себе роль незалежного дистриб'ютора.
🌍 • Ми шукаємо клієнтів і покупців відповідно до можливостей ринку в Європі.
💼 • Лише невеликий внесок у маркетингові, транспортні та операційні витрати стягуватиметься щомісяця як фіксована ставка.
📊 • Нам потрібно лише мати можливість додати принаймні 20% до нашої собівартості (собівартість = ціна придбання, включаючи транспортні, митні та всі інші витрати).
🚚 • Ми подбаємо про все, вам потрібно лише доставити товар.
⏳ • Від замовлення до початку роботи нам потрібен короткий час від 4 до 8 тижнів.

❓ Ви не знайшли послугу, яку шукали?
Це не є проблемою. Просто повідомте нам, яка послуга вам потрібна, і ми подбаємо про це і зробимо вам пропозицію, адаптовану до ваших потреб.

🕒 Термін надання послуг:
Послуга починається якнайшвидше з замовлення послуги. Датою початку надання послуги буде дата, зазначена в договорі, але не пізніше, ніж з моменту отримання суми, зазначеної в договорі. Проект завершується після досягнення мети, зазначеної в договорі, або зазначеної дати завершення.

🔄 Контроль:
Виконавець зобов'язаний регулярно інформувати клієнта про хід роботи Компанії.
Клієнт буде повідомлений, про зміни в австрійському законодавстві, які впливають на діяльність філії.

📈 Розширення та зміна проекту:
Розширення проекту (наприклад, зміни в маркетингових концепціях, пошук персоналу, проведення юридичних консультацій…) мають бути сформульовані та погоджені та не впливати на цю проектну угоду.

🛑 Дострокове припинення:
Співпраця може бути припинена в будь-який час, починаючи з шостого місяця, за умови попередження за 2 місяці з обох сторін. Якщо співпраця припиняється, клієнт повинен повідомити суд комерційного реєстру про нового представника та/або нову компанію адресу. Витрати на зміну відповідальних органів оплачує клієнт. Якщо Ruttensteiner дізнається, що клієнт порушує австрійські правила торгівлі, бухгалтерського обліку чи інші чинні закони, Ruttensteiner може негайно розірвати договір.

💰 Витрати в разі розірвання договору:
Повне або часткове повернення вже виставлених рахунків або сплачених компонентів винагороди виключається у випадку розірвання контракту, що прирівнюється до його закінчення.

🔐 Незалежність в виконанні наказів клієнта:
Якщо це не обумовлено характером замовлення, підрядник не має підпорядковуватись будь-яким інструкціям замовника при виконанні договору або при виконанні взятого ним замовлення щодо розподілу часу та організації діяльності.

🔒 Конфіденційність:
Вся інформація, яка доводиться до відома виконавця в ході його консультаційної роботи, є конфіденційною. Підрядник зобов'язується використовувати цю інформацію лише в контексті цього договору та не передавати її третім особам. Інформація, позначена замовником як суворо конфіденційна, може бути використана підрядником лише за чіткою згодою замовника.

💳 Платіжи:
Рахунки завжди мають бути негайно сплачени після отримання. Рахунки, неоплачені понад 30 днів, будуть передані до KSV1870.

Банківські реквізити:
Raiffeisenbank IBAN: AT38 3411 4000 0010 5908 BIC: RZOOAT2L114
VKB IBAN: AT89 1860 0000 1650 9309 BIC :VKBLAT2L

📜 Інше:
Перелічені тут пункти договору замінюють та/або доповнюють загальні положення та умови підрядника, які можна знайти за наступним посиланням, кожен з яких наразі дійсний. www.ruttensteiner.com/images/AGB/AGB-2016-DE.pdf

Регресні претензії будь-якого роду за рахунок і на шкоду підряднику через технічні або економічні дефекти з боку клієнта не допускаються. Оскарження контракту через помилку §871 ABGB і скорочення на половину §934 ABGB не допускається.""")


@dp.message(F.text == 'Про нас')
async def cmd_text1(message: Message):
    await message.answer("""✅Більш ніж за 30 років, Ruttensteiner Business Consulting змогла побудувати безцінну широку мережу в різноманітних галузях. Саме ці контакти приносять клієнтам додаткову цінність, яку вони очікують від бізнес-консультаційної агенції. 

✅Швидкі та небюрократичні рішення.
Агентство виділяється серед інших своїм особливим іміджем: «Ми більше, ніж консультанти. Ми робимо все, щоб наші клієнти досягали своїх цілей», – говорить засновник і власник Дітмар Ервін Руттенштайнер. Це означає, що агентство не тільки надає консультації, але й бере на себе оперативну діяльність, таку як реєстрація представництв, активне сприяння продажу товарів клієнта, організацію та оформлення створення компаній і філій.Тим часом Руттенштайнер і його команда опікувалися компаніями з 14 країн світу. Ми раді, якщо ми також можемо зарахувати вас до наших клієнтів. 

    📞Ваше запитання відсилайте WhatsApp +38 0672098020 """)


@dp.message(F.text == 'Контакти📞')
async def cmd_text1(message: Message):
    await message.answer("""WhatsApp +380672098020
    Telegram +380672098020 або @Wolfgang_Bergmann
    E-Mail vbfunds@gmail.com""")


async def main():
    await dp.start_polling(bot)


if __name__ == '__main__':
    try:
        asyncio.run(main())
    except KeyboardInterrupt:
        print("нічо не працює")